Revit 2027 API
NumberingFormattedParameter Properties
The NumberingFormattedParameter type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Prefix |  Prefix corresponding to the included parameter.
SampleValue |  Sample values corresponding to the included parameter.
Separator |  Separators corresponding to the included parameter.
Suffix |  Suffix corresponding to the included parameter.
Top
See Also
Reference
NumberingFormattedParameter Class
Autodesk.Revit.DB Namespace